In [1]:
import pandas as pd

In [2]:
labels =['Prashant','Ishan','Angelina']
type(labels)

list

In [6]:
!pip install pandas

Requirement already satisfied: pandas in c:\users\user\anaconda3\lib\site-packages (1.5.2)
Requirement already satisfied: numpy>=1.20.3 in c:\users\user\anaconda3\lib\site-packages (from pandas) (1.23.5)
Requirement already satisfied: python-dateutil>=2.8.1 in c:\users\user\anaconda3\lib\site-packages (from pandas) (2.8.2)
Requirement already satisfied: pytz>=2020.1 in c:\users\user\anaconda3\lib\site-packages (from pandas) (2022.7)
Requirement already satisfied: six>=1.5 in c:\users\user\anaconda3\lib\site-packages (from python-dateutil>=2.8.1->pandas) (1.16.0)

In [7]:
import numpy as np
arr = np.array([1,2,3,4,5])
d={'Prashant':3,'Ishan':4,'Samman':4,'Rishad':5,'Anurag':69}

In [8]:
pd.Series(arr)

0    1
1    2
2    3
3    4
4    5
dtype: int32

In [9]:
pd.Series(d)

Prashant     3
Ishan        4
Samman       4
Rishad       5
Anurag      69
dtype: int64

In [12]:
my_list = np.arange(5)
my_list

array([0, 1, 2, 3, 4])

In [15]:
labels=['Prashant', 'Ishan', 'Angelina','Samman','Bijay']

In [16]:
pd.Series(data=my_list,index=labels)

Prashant    0
Ishan       1
Angelina    2
Samman      3
Bijay       4
dtype: int32

In [17]:
ser1 =pd.Series([1,2,3,4],index=['USA','Nepal','USSR','Germany'])
ser1

USA        1
Nepal      2
USSR       3
Germany    4
dtype: int64

In [18]:
ser2 =pd.Series([1,2,3,4],index=['USA','India','China','Germany'])
ser2

USA        1
India      2
China      3
Germany    4
dtype: int64

In [19]:
ser1 =pd.Series([1,2,3,4],index=['USA','Nepal','USSR','Germany'])
ser2 =pd.Series([1,2,3,4],index=['USA','India','China','Germany'])
ser1+ser2

China      NaN
Germany    8.0
India      NaN
Nepal      NaN
USA        2.0
USSR       NaN
dtype: float64

In [20]:
ser1.add(ser2)

China      NaN
Germany    8.0
India      NaN
Nepal      NaN
USA        2.0
USSR       NaN
dtype: float64

In [21]:
pd.DataFrame?

Init signature:
pd.DataFrame(
    data=None,
    index: 'Axes | None' = None,
    columns: 'Axes | None' = None,
    dtype: 'Dtype | None' = None,
    copy: 'bool | None' = None,
) -> 'None'
Docstring:
Two-dimensional, size-mutable, potentially heterogeneous tabular data.

Data structure also contains labeled axes (rows and columns).
Arithmetic operations align on both row and column labels. Can be
thought of as a dict-like container for Series objects. The primary
pandas data structure.

Parameters
----------
data : ndarray (structured or homogeneous), Iterable, dict, or DataFrame
    Dict can contain Series, arrays, constants, dataclass or list-like objects. If
    data is a dict, column order follows insertion-order. If a dict contains Series
    which have an index defined, it is aligned by its index.

    .. versionchanged:: 0.25.0
       If data is a list of dicts, column order follows insertion-order.

index : Index or array-like
    Index to use for resulting frame. Will default to RangeIndex if
    no indexing information part of input data and no index provided.
columns : Index or array-like
    Column labels to use for resulting frame when data does not have them,
    defaulting to RangeIndex(0, 1, 2, ..., n). If data contains column labels,
    will perform column selection instead.
dtype : dtype, default None
    Data type to force. Only a single dtype is allowed. If None, infer.
copy : bool or None, default None
    Copy data from inputs.
    For dict data, the default of None behaves like ``copy=True``.  For DataFrame
    or 2d ndarray input, the default of None behaves like ``copy=False``.
    If data is a dict containing one or more Series (possibly of different dtypes),
    ``copy=False`` will ensure that these inputs are not copied.

    .. versionchanged:: 1.3.0

See Also
--------
DataFrame.from_records : Constructor from tuples, also record arrays.
DataFrame.from_dict : From dicts of Series, arrays, or dicts.
read_csv : Read a comma-separated values (csv) file into DataFrame.
read_table : Read general delimited file into DataFrame.
read_clipboard : Read text from clipboard into DataFrame.

Notes
-----
Please reference the :ref:`User Guide <basics.dataframe>` for more information.

Examples
--------
Constructing DataFrame from a dictionary.

>>> d = {'col1': [1, 2], 'col2': [3, 4]}
>>> df = pd.DataFrame(data=d)
>>> df
   col1  col2
0     1     3
1     2     4

Notice that the inferred dtype is int64.

>>> df.dtypes
col1    int64
col2    int64
dtype: object

To enforce a single dtype:

>>> df = pd.DataFrame(data=d, dtype=np.int8)
>>> df.dtypes
col1    int8
col2    int8
dtype: object

Constructing DataFrame from a dictionary including Series:

>>> d = {'col1': [0, 1, 2, 3], 'col2': pd.Series([2, 3], index=[2, 3])}
>>> pd.DataFrame(data=d, index=[0, 1, 2, 3])
   col1  col2
0     0   NaN
1     1   NaN
2     2   2.0
3     3   3.0

Constructing DataFrame from numpy ndarray:

>>> df2 = pd.DataFrame(np.array([[1, 2, 3], [4, 5, 6], [7, 8, 9]]),
...                    columns=['a', 'b', 'c'])
>>> df2
   a  b  c
0  1  2  3
1  4  5  6
2  7  8  9

Constructing DataFrame from a numpy ndarray that has labeled columns:

>>> data = np.array([(1, 2, 3), (4, 5, 6), (7, 8, 9)],
...                 dtype=[("a", "i4"), ("b", "i4"), ("c", "i4")])
>>> df3 = pd.DataFrame(data, columns=['c', 'a'])
...
>>> df3
   c  a
0  3  1
1  6  4
2  9  7

Constructing DataFrame from dataclass:

>>> from dataclasses import make_dataclass
>>> Point = make_dataclass("Point", [("x", int), ("y", int)])
>>> pd.DataFrame([Point(0, 0), Point(0, 3), Point(2, 3)])
   x  y
0  0  0
1  0  3
2  2  3
File:           c:\users\user\anaconda3\lib\site-packages\pandas\core\frame.py
Type:           type
Subclasses:     SubclassedDataFrame

In [22]:
df = pd.DataFrame(np.random.randn(5,4),index=('A','B','C','D','E'),columns=('W','X','Y','Z'))
df

          W         X         Y         Z
A  0.258497  0.525512 -0.023922 -0.906040
B  0.167225  1.449274 -0.052084 -0.692410
C  0.819742  0.003616 -2.052933 -0.078551
D  0.029466 -1.386170  0.247525  0.768998
E  0.711259 -0.940195  0.626604 -0.170131

In [23]:
type(df)

pandas.core.frame.DataFrame

In [24]:
type(df['W'])

pandas.core.series.Series

In [25]:
df

          W         X         Y         Z
A  0.258497  0.525512 -0.023922 -0.906040
B  0.167225  1.449274 -0.052084 -0.692410
C  0.819742  0.003616 -2.052933 -0.078551
D  0.029466 -1.386170  0.247525  0.768998
E  0.711259 -0.940195  0.626604 -0.170131

In [29]:
df.loc['C']

W    0.819742
X    0.003616
Y   -2.052933
Z   -0.078551
Name: C, dtype: float64

In [32]:
df

          W         X         Y         Z
A  0.258497  0.525512 -0.023922 -0.906040
B  0.167225  1.449274 -0.052084 -0.692410
C  0.819742  0.003616 -2.052933 -0.078551
D  0.029466 -1.386170  0.247525  0.768998
E  0.711259 -0.940195  0.626604 -0.170131

In [31]:
df.iloc[[2,4],1]

C    0.003616
E   -0.940195
Name: X, dtype: float64

In [45]:
df.iloc[2:4,1:2]

          X
C  0.003616
D -1.386170

In [40]:
df>0

      W      X      Y      Z
A  True   True  False  False
B  True   True  False  False
C  True   True  False  False
D  True  False   True   True
E  True  False   True  False

In [41]:
df[df>0]

          W         X         Y         Z
A  0.258497  0.525512       NaN       NaN
B  0.167225  1.449274       NaN       NaN
C  0.819742  0.003616       NaN       NaN
D  0.029466       NaN  0.247525  0.768998
E  0.711259       NaN  0.626604       NaN

In [42]:
df[df['W']>0]['Y']

A   -0.023922
B   -0.052084
C   -2.052933
D    0.247525
E    0.626604
Name: Y, dtype: float64

In [87]:
df = pd.DataFrame({'CE':[1,2,0],'CS':[5,0,2],'EE':[11,2,2],'Pharmacy':[np.nan,15,23]}
    ,index=('C++','Math','Electrical'))

In [88]:
df

            CE  CS  EE  Pharmacy
C++          1   5  11       NaN
Math         2   0   2      15.0
Electrical   0   2   2      23.0

In [89]:
df.dropna(axis=0)

            CE  CS  EE  Pharmacy
Math         2   0   2      15.0
Electrical   0   2   2      23.0

In [90]:
df.dropna()

            CE  CS  EE  Pharmacy
Math         2   0   2      15.0
Electrical   0   2   2      23.0

In [91]:
df.dropna(axis=1)

            CE  CS  EE
C++          1   5  11
Math         2   0   2
Electrical   0   2   2

In [92]:
df.fillna(value='Fill value')

            CE  CS  EE    Pharmacy
C++          1   5  11  Fill value
Math         2   0   2        15.0
Electrical   0   2   2        23.0

In [95]:
df['Pharmacy'].fillna(value=df['Pharmacy'].mean(),inplace=True)

In [96]:
df

            CE  CS  EE  Pharmacy
C++          1   5  11      19.0
Math         2   0   2      15.0
Electrical   0   2   2      23.0

In [85]:
type(df['Pharmacy'][0])

numpy.float64

In [86]:
df['Pharmacy'] = df['Pharmacy'].fillna(value=df['Pharmacy'].mean())

In [77]:
df

            CE  CS  EE  Pharmacy
C++          1   5  11      19.0
Math         2   0   2      15.0
Electrical   0   2   2      23.0

In [97]:
df['CE'].mean()

1.0

In [98]:
data = {'Subject':['DBMS','DBMS','MCSC','MCSC','DIFF','DIFF'],
       'Instructor':['Santosh','Nabin','Gokul','Ram','Saraswoti','Khim'],
       'Assignments':[10,2,4,5,6,4]}

In [101]:
df = pd.DataFrame(data)
df

  Subject Instructor  Assignments
0    DBMS    Santosh           10
1    DBMS      Nabin            2
2    MCSC      Gokul            4
3    MCSC        Ram            5
4    DIFF  Saraswoti            6
5    DIFF       Khim            4

In [102]:
df.set_index('Subject')

        Instructor  Assignments
Subject
DBMS       Santosh           10
DBMS         Nabin            2
MCSC         Gokul            4
MCSC           Ram            5
DIFF     Saraswoti            6
DIFF          Khim            4